Revit 2027 API
ParameterTypeId.SelectionEditableOnly Property
 "Editable only"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SelectionEditableOnly { get; }
Public Shared ReadOnly Property SelectionEditableOnly As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SelectionEditableOnly {
	ForgeTypeId^ get ();
}
static member SelectionEditableOnly : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace